package data_types;

public class Main {
	public static void main(String[] args) {
		byte b = 28; // от -128 до 127 и занимает 1 байт
		short s = 881; // от -32768 до 32767 и занимает 2 байта 
		char c = 'A'; // обязательно в одинарных кавычках и занимает 2 байта
		int i = 21; // от -2147483648 до 2147483647 и занимает 4 байта
		long l = 92929; // от -9_223_372_036_854_775_808 до 9_223_372_036_854_775_807 и занимает 8 байт
		float f = 93.83F; // обязательно F в конце
		double d = 94.8383; // в double можно поместить в 2 раза больше чем в float
		boolean bool = true;
		String str = "Hello world!";

		/**
		 * Есть классы обертки по типу:
		 * Long, Integer, ...
		 * Они дают встроенные методы для типов данных и по умолчанию могут хранить null
		 */
	}
}